---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomConditionTypeParam
source: html/04ee228e-9401-a185-3081-c3f55cb3f8e3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomConditionTypeParam Property

"Condition Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomConditionTypeParam { get; }
```